fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияКонец</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// ++ Соколовская О.В. 13.09.2026 Работа с заявками клиентов
	// Вывести на форму новые реквизиты договора, если вид договора заполнен
	ЭлементПериодДействияНачало = Элементы.Добавить("ПериодДействияНачало", Тип("Полеформы"));
	ЭлементПериодДействияНачало.Заголовок = "Период действия начало";
	ЭлементПериодДействияНачало.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементПериодДействияНачало.ПутьКДанным = "Объект.ВКМ_ПериодДействияНачало";
	ЭлементПериодДействияНачало.Видимость = АбонентскоеОбслуживание(Объект.ВидДоговора);
	
	ЭлементПериодДействияКонец = Элементы.Добавить("ПериодДействияКонец", Тип("Полеформы"));
	ЭлементПериодДействияКонец.Заголовок = "Период действия конец";
	ЭлементПериодДействияКонец.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементПериодДействияКонец.ПутьКДанным = "Объект.ВКМ_ПериодДействияКонец";
	ЭлементПериодДействияКонец.Видимость = АбонентскоеОбслуживание(Объект.ВидДоговора);
	
	ЭлементСуммаАбонентскойПлаты = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"));
	ЭлементСуммаАбонентскойПлаты.Заголовок = "Сумма абонентской платы";
	ЭлементСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ЭлементСуммаАбонентскойПлаты.Видимость = АбонентскоеОбслуживание(Объект.ВидДоговора);
	
	ЭлементСтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ЭлементСтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы";
	ЭлементСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ЭлементСтоимостьЧасаРаботы.Видимость = АбонентскоеОбслуживание(Объект.ВидДоговора);
	// -- Соколовская О.В. 13.09.2026
	  
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	// ++ Соколовская О.В. 13.09.2026 Работа с заявками клиентов
	// Вывести на форму новые реквизиты договора, если вид договора заполнен
	ВидДоговора = Объект.ВидДоговора;
	
	Элементы.ПериодДействияНачало.Видимость = АбонентскоеОбслуживание(ВидДоговора);
	Элементы.ПериодДействияКонец.Видимость = АбонентскоеОбслуживание(ВидДоговора);
	Элементы.СуммаАбонентскойПлаты.Видимость = АбонентскоеОбслуживание(ВидДоговора);
	Элементы.СтоимостьЧасаРаботы.Видимость = АбонентскоеОбслуживание(ВидДоговора);
	// -- Соколовская О.В. 13.09.2026

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ++ Соколовская О.В. 13.09.2026 Работа с заявками клиентов
//@skip-check module-unused-method
&НаСервереБезКонтекста
Функция АбонентскоеОбслуживание(Знач ВидДоговора)
	
	Возврат ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
	
КонецФункции

#КонецОбласти
